; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v8 - type_3 ?v3 - type_2)
 	      (pred_2 ?v7 - object ?v3 - type_2)
	      (pred_3 ?v8 - type_3 ?v4 - type_1)
	      (pred_1 ?v8 - type_3 ?v7 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v8 - type_3 ?v5 ?v6 - type_2)
       :precondition (and  (pred_4 ?v8 ?v5))
       :effect (and  (pred_4 ?v8 ?v6)
		     (not (pred_4 ?v8 ?v5))))

   (:action op_1
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v2) (pred_4 ?v8 ?v2) (pred_3 ?v8 ?v4))
       :effect (and (pred_1 ?v8 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v2)) 
		    (not (pred_3 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v1 ?v4) (pred_4 ?v8 ?v2))
       :effect (and (pred_2 ?v1 ?v2)
		    (pred_3 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v1 ?v4)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_3
obj_04 obj_06 - type_1
obj_05 obj_03 obj_09 - type_2
obj_02 obj_07 obj_01 - object)
(:init
(pred_4 obj_08 obj_09)
(pred_3 obj_08 obj_04)
(pred_3 obj_08 obj_06)
(pred_2 obj_02 obj_05)
(pred_2 obj_07 obj_09)
(pred_2 obj_01 obj_09)
)
(:goal
(and
(pred_2 obj_02 obj_03)
(pred_2 obj_07 obj_09)
(pred_2 obj_01 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_08 ?b obj_06))))
)
)

; plan
1. (op_3 obj_08 obj_09 obj_05)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_05)
   goals met: 2 of 3
2. (op_1 obj_08 obj_02 obj_05 obj_04)
   deleted: (pred_2 obj_02 obj_05) (pred_3 obj_08 obj_04)
   added: (pred_1 obj_08 obj_02 obj_04)
   goals met: 2 of 3
3. (op_3 obj_08 obj_05 obj_03)
   deleted: (pred_4 obj_08 obj_05)
   added: (pred_4 obj_08 obj_03)
   goals met: 2 of 3
4. (op_2 obj_08 obj_02 obj_03 obj_04)
   deleted: (pred_1 obj_08 obj_02 obj_04)
   added: (pred_2 obj_02 obj_03) (pred_3 obj_08 obj_04)
   goals met: 3 of 3
